app/controllers/sessions_controller.rb

SELECT * FROM "users" WHERE ("users"."password" = 'Love20121014' AND "users"."login" = 'juye') LIMIT 1
---
  def create
    @current_user = User.find_by_login_and_password(params[:login],params[:password])