app/controllers/stories_controller.rb

SELECT * FROM "stories" ORDER BY RANDOM() LIMIT 1
---
  def index
#    @story = Story.find(:first, :order => 'RANDOM()')
    @story = Story.first

SELECT * FROM `stories` WHERE (`stories`.`id` = 3)
---
  def show
    @story = Story.find(params[:id])

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
---
  def edit
    @story = Story.find(params[:id])

INSERT INTO `stories` (`link`, `user_id`, `name`, `updated_at`, `created_at`) VALUES('http://sangminpark.wordpress.com', 1, 'parksangmin blog', '2013-08-11 11:14:15', '2013-08-11 11:14:15')
---
  def create
    @story = @current_user.stories.build params[:story]

    respond_to do |format|
      if @story.save

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
UPDATE "stories" SET "name" = 'Juye Kim''s Blog', "updated_at" = '2013-04-24 06:34:23' WHERE "id" = 1
---
  def update
    @story = Story.find(params[:id])

    respond_to do |format|
      if @story.update_attributes(params[:story])

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
DELETE FROM "stories" WHERE "id" = 1
---
  def destroy
    @story = Story.find(params[:id])
    @story.destroy