app/controllers/votes_controller.rb

  def create
    @story = Story.find(params[:story_id])
    @story.votes.create
---
SELECT * FROM `stories` WHERE (`stories`.`id` = 2)
INSERT INTO `votes` (`user_id`, `story_id`, `updated_at`, `created_at`) VALUES(NULL, 2, '2013-08-11 11:16:56', '2013-08-11 11:16:56')